# Pandas
Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [2]:
import pandas as pd

## Series
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [26]:
fruits = pd.Series(["apple", "pear", "orange", "melon", "kiwi"])
fruits

0     apple
1      pear
2    orange
3     melon
4      kiwi
dtype: object

In [10]:
fruits.apply(str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [9]:
numbers = pd.Series([5, 6, 3])
numbers * 2 + 1

0    11
1    13
2     7
dtype: int64

In [34]:
mask = numbers >= 5
type(mask)

pandas.core.series.Series

In [35]:
numbers[pd.Series([True, True, False])]

0    5
1    6
dtype: int64

## DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet, or a dict of Series objects. It is generally the most commonly used pandas object.

In [38]:
data = {
    "Name": ["Anders", "Tomas", "Mario"],
    "Age": [42, 46, 36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [40]:
data = [
    {"Name": "Anders", "Age": 42},
    {"Name": "Tomas", "Age": 46},
    {"Name": "Mario", "Age": 36}
]

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Mario   36

In [46]:
df["Name"]

0    Anders
1     Tomas
2     Mario
Name: Name, dtype: object

In [54]:
df["Age"] = df["Age"] + 1
df

     Name  Age
0  Anders   47
1   Tomas   51
2   Mario   41

In [56]:
df["Age"] >= 50

0    False
1     True
2    False
Name: Age, dtype: bool

In [57]:
df[df["Age"] >= 50]

    Name  Age
1  Tomas   51

In [58]:
str(df)

'     Name  Age\n0  Anders   47\n1   Tomas   51\n2   Mario   41'

In [59]:
print(df)

     Name  Age
0  Anders   47
1   Tomas   51
2   Mario   41